In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df=pd.read_csv("2025-cs3-mid-2.csv")
print(df.shape)
print(df.info())
display(df.head())

(150, 6)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Cust_ID        150 non-null    object
 1   Area           145 non-null    object
 2   Client_Type    150 non-null    object
 3   Annual_Spend   145 non-null    float64
 4   Transactions   150 non-null    int64
 5   Loyalty_Score  145 non-null    float64
dtypes: float64(2), int64(1), object(3)
memory usage: 7.2+ KB
None

  Cust_ID     Area Client_Type  Annual_Spend  Transactions  Loyalty_Score
0   C0001     East  Home Ofice       50547.0            39           0.16
1   C0002     West    Consumer       42181.0            41           0.18
2   C0003  Central    Consumer       75727.0            44           0.86
3   C0004     West   Corporate       57607.0            36           0.95
4   C0005    South  Home Ofice       25698.0            43           0.37

In [3]:
display(df[df.duplicated(keep=False)])

    Cust_ID  Area Client_Type  Annual_Spend  Transactions  Loyalty_Score
125   C0126  East   Corporate       46536.0            44           0.69
148   C0126  East   Corporate       46536.0            44           0.69

In [6]:
df1m = df.drop_duplicates().reset_index(drop=True)
print(df1m.shape)

(149, 6)

In [8]:
display(df1m[df1m.duplicated(keep=False)])

Empty DataFrame
Columns: [Cust_ID, Area, Client_Type, Annual_Spend, Transactions, Loyalty_Score]
Index: []

In [9]:
print(df1m.isnull().sum())

Cust_ID          0
Area             5
Client_Type      0
Annual_Spend     5
Transactions     0
Loyalty_Score    5
dtype: int64

In [12]:
display(df1m.isnull().any(axis=1))

0      False
1      False
2      False
3      False
4      False
       ...
144     True
145    False
146    False
147    False
148    False
Length: 149, dtype: bool

In [18]:
display(df1m.head())

  Cust_ID     Area Client_Type  Annual_Spend  Transactions  Loyalty_Score
0   C0001     East  Home Ofice       50547.0            39           0.16
1   C0002     West    Consumer       42181.0            41           0.18
2   C0003  Central    Consumer       75727.0            44           0.86
3   C0004     West   Corporate       57607.0            36           0.95
4   C0005    South  Home Ofice       25698.0            43           0.37

In [23]:
mu = df1m[["Annual_Spend","Transactions","Loyalty_Score"]].mean()
print(mu)

Annual_Spend     50605.673611
Transactions        38.610738
Loyalty_Score        0.464514
dtype: float64

In [32]:
df_filled = df1m.fillna(df1m[["Annual_Spend","Transactions","Loyalty_Score"]].mean())
display(df_filled.head())
print(df_filled.info())
print(df_filled.shape)

  Cust_ID     Area Client_Type  Annual_Spend  Transactions  Loyalty_Score
0   C0001     East  Home Ofice       50547.0            39           0.16
1   C0002     West    Consumer       42181.0            41           0.18
2   C0003  Central    Consumer       75727.0            44           0.86
3   C0004     West   Corporate       57607.0            36           0.95
4   C0005    South  Home Ofice       25698.0            43           0.37

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Cust_ID        149 non-null    object
 1   Area           144 non-null    object
 2   Client_Type    149 non-null    object
 3   Annual_Spend   149 non-null    float64
 4   Transactions   149 non-null    int64
 5   Loyalty_Score  149 non-null    float64
dtypes: float64(2), int64(1), object(3)
memory usage: 7.1+ KB
None
(149, 6)

In [28]:
display(df_filled.isnull().any(axis=1))

0      False
1      False
2      False
3      False
4      False
       ...
144    False
145    False
146    False
147    False
148    False
Length: 149, dtype: bool

In [29]:
df_filled2 = df_filled.dropna().reset_index(drop=True)

In [31]:
print(df_filled2.info())
print(df_filled2.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Cust_ID        144 non-null    object
 1   Area           144 non-null    object
 2   Client_Type    144 non-null    object
 3   Annual_Spend   144 non-null    float64
 4   Transactions   144 non-null    int64
 5   Loyalty_Score  144 non-null    float64
dtypes: float64(2), int64(1), object(3)
memory usage: 6.9+ KB
None
(144, 6)

In [33]:
df_filled2["Annual_Spend"] = df_filled2["Annual_Spend"].astype(int)

In [36]:
print(df_filled2["Annual_Spend"].dtype)

int32

In [37]:
print(df_filled2["Client_Type"].value_counts())

Client_Type
Consumer      40
HomeOffice    40
Corporate     30
Home Ofice    14
Corporatte    12
Consmr         8
Name: count, dtype: int64